app/Controllers/Client.php

    public function index()
{
    $model = new ClientModel();

    // Ambil parameter ?sort dari URL
    $sort = $this->request->getGet('sort');

    // Default urutan (by id ascending)
    switch ($sort) {
        case 'az':
            $model->orderBy('nama_client', 'ASC');
            break;
        case 'za':
            $model->orderBy('nama_client', 'DESC');
            break;
        case 'newest':
            $model->orderBy('registerdate_client', 'DESC');
            break;
        case 'oldest':
            $model->orderBy('registerdate_client', 'ASC');
            break;
        default:
            $model->orderBy('id_client', 'ASC');
            break;
    }

    $data['clients'] = $model->findAll();         // list sesuai urutan
---
SELECT *
FROM `client`
WHERE `client`.`id_client` = '2'