app/Controllers/Client.php

SELECT *
FROM `client`
---
    public function index()
    {
        $model = new ClientModel();
        $data['clients'] = $model->findAll(); // list semua

SELECT *
FROM `client`
---
    public function edit($id)
    {
        $model = new ClientModel();
        $data['clients'] = $model->findAll(); // tetap tampilkan semua