app/Controllers/Cobadashboard.php

    public function index()
    {
        helper('url');

        $employeeModel = new EmployeeModel();
        $clientModel   = new ClientModel();
        $projectModel  = new ProjectModel();
        $menuModel = new MenuModel();
        $roleModel = new RoleModel();
        $roledetailModel = new RoledetailModel();
        $sheetModel = new SheetModel();


        $data['total_employee'] = $employeeModel->countAll();
        $data['total_client']   = $clientModel->countAll();
        $data['total_project']  = $projectModel->countAll();
        $data['total_menu'] = $menuModel->countAll();
        $data['total_role'] = $roleModel->countAll();
        $data['total_roledetail'] = $roledetailModel->countAll();
        $data['total_sheet'] = $sheetModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `employee`
SELECT COUNT(*) AS `numrows` FROM `client`
SELECT COUNT(*) AS `numrows` FROM `project`
SELECT COUNT(*) AS `numrows` FROM `menu`
SELECT COUNT(*) AS `numrows` FROM `role`
SELECT COUNT(*) AS `numrows` FROM `roledetail`
SELECT COUNT(*) AS `numrows` FROM `sheet`