app/Controllers/DashboardUser.php

    public function index()
    {
        helper('url');

        $id_employee = session()->get('id_employee');

        $sheetModel    = new SheetModel();
        $projectModel  = new ProjectModel();
        $clientModel   = new ClientModel();
        $roleModel     = new RoleModel();
        $employeeModel = new EmployeeModel();

        $sheetsAll = $sheetModel->getWithEmployeeAndProjectAndRole();

        $data['sheets'] = array_filter($sheetsAll, function ($s) use ($id_employee) {
            return $s['id_employee'] == $id_employee;
        });

        $data['total_sheet'] = $sheetModel
            ->where('id_employee', $id_employee)
            ->countAllResults();

        $data['total_project'] = $projectModel
            ->where('id_employee', $id_employee)
            ->countAllResults();

        $data['total_client'] = $clientModel->countAll();

        $employee = $employeeModel->find($id_employee);
        if ($employee && $employee['id_role']) {
            $data['role'] = $roleModel->find($employee['id_role']);
---
SELECT COUNT(*) AS `numrows`
FROM `sheet`
WHERE `id_employee` = '4'
SELECT COUNT(*) AS `numrows`
FROM `project`
WHERE `id_employee` = '4'
SELECT COUNT(*) AS `numrows` FROM `client`
SELECT *
FROM `employee`
WHERE `employee`.`id_employee` = '4'
SELECT *
FROM `role`
WHERE `role`.`id_role` = '1'