app/Controllers/Employee.php

SELECT *
FROM `employee`
SELECT *
FROM `role`
---
    public function index()
    {
        $employeemodel = new EmployeeModel();
        $rolemodel = new RoleModel();

        $data['employees'] = $employeemodel->findAll();
        $data['roles'] = $rolemodel->findAll();

SELECT *
FROM `employee`
SELECT *
FROM `role`
---
    public function create()
{
    $employeemodel = new EmployeeModel();
        $rolemodel = new RoleModel();

        $data['employees'] = $employeemodel->findAll();
        $data['roles'] = $rolemodel->findAll();

SELECT *
FROM `employee`
SELECT *
FROM `role`
---
    public function edit($id)
{
    $employeemodel = new EmployeeModel();
    $rolemodel = new RoleModel();

    $data ['employees'] = $employeemodel->findAll(); // tetap tampilkan semua
    $data['roles'] = $rolemodel->findAll();