app/Controllers/Menu.php

    public function index()
    {
        $model = new MenuModel();
        $data['menus'] = $model->findAll();
---
SELECT *
FROM `menu`