app/Controllers/Project.php

    public function index()
    {
        $projectModel = new ProjectModel();
        $clientModel = new ClientModel();
        $employeeModel = new EmployeeModel();

        $data['projects'] = $projectModel->findAll();
        $data['clients'] = $clientModel->findAll();
        $data['employees'] = $employeeModel->findAll();
---
SELECT *
FROM `project`
SELECT *
FROM `client`
SELECT *
FROM `employee`

public function edit($id)
{
    $projectModel = new ProjectModel();
    $clientModel = new ClientModel();
    $employeeModel = new EmployeeModel();

    $data ['projects'] = $projectModel->findAll();
    $data['clients'] = $clientModel->findAll();
    $data['employees'] = $employeeModel->findAll();
---
SELECT *
FROM `client`
SELECT *
FROM `employee`