app/Controllers/RoleDetail.php

SELECT *
FROM `roledetail`
SELECT *
FROM `role`
SELECT *
FROM `menu`
---
    public function index()
    {
        $model = new RoleDetailModel();
        $roleModel = new RoleModel();
        $menuModel = new MenuModel();

        $data['roledetails'] = $model->findAll();
        $data['roles'] = $roleModel->findAll();
        $data['menus'] = $menuModel->findAll();