app/Controllers/Sheet.php

SELECT *
FROM `employee`
SELECT *
FROM `role`
---
    public function index()
    {
        $model = new SheetModel();
        $employeeModel = new EmployeeModel();
        $roleModel = new RoleModel();

        $data['employees'] = $employeeModel->findAll();
        $data['roles'] = $roleModel->findAll();