app/Controllers/SheetUser.php

SELECT *
FROM `sheet`
WHERE `id_project` = '1'
AND `id_employee` = '4'
ORDER BY `date_sheet` DESC
---
    public function detail($id)
    {
        $model = new SheetModel();
        $sheet = $model->find($id);
        $id_employee = session()->get('id_employee');

        $sheet = $model->getDetailById($id, $id_employee);
        if (!$sheet) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data tidak ditemukan atau akses ditolak.');
        }

        $data['activities'] = $model->where('id_project', $sheet['id_project'])
                            ->where('id_employee', session()->get('id_employee'))
                            ->orderBy('date_sheet', 'DESC')
                            ->findAll();

SELECT *
FROM `project`
---
    public function create()
    {
        $projectModel = new ProjectModel();

        $data['projects'] = $projectModel->findAll();