app/Controllers/Sheet.php

SELECT *
FROM `sheet`
---
    public function index()
    {
        $model = new SheetModel();
        $data['sheets'] = $model->findAll();