app/Models/ProjectModel.php

SELECT `project`.*, `client`.`nama_client`, `employee`.`nama_employee`
FROM `project`
JOIN `client` ON `client`.`id_client` = `project`.`id_client`
JOIN `employee` ON `employee`.`id_employee` = `project`.`id_employee`
---
    public function getWithClientAndEmployee()
{
    return $this->select('project.*, client.nama_client, employee.nama_employee')
                ->join('client', 'client.id_client = project.id_client')
                ->join('employee', 'employee.id_employee = project.id_employee')
                ->findAll();