app/Models/SheetModel.php

public function getWithEmployeeAndProjectAndRoleByEmployee($id_employee)
{
    return $this->select('sheet.*, employee.nama_employee, project.nama_project, role.judul_role')
        ->join('employee', 'employee.id_employee = sheet.id_employee')
        ->join('project', 'project.id_project = sheet.id_project')
        ->join('role', 'role.id_role = employee.id_role')
        ->where('sheet.id_employee', $id_employee)
        ->findAll();
---
SELECT `sheet`.*, `employee`.`nama_employee`, `project`.`nama_project`, `role`.`judul_role`
FROM `sheet`
JOIN `employee` ON `employee`.`id_employee` = `sheet`.`id_employee`
JOIN `project` ON `project`.`id_project` = `sheet`.`id_project`
JOIN `role` ON `role`.`id_role` = `employee`.`id_role`
WHERE `sheet`.`id_employee` IS NULL