app/Models/SheetModel.php

SELECT `sheet`.*, `employee`.`nama_employee`, `project`.`nama_project`, `role`.`judul_role`
FROM `sheet`
LEFT JOIN `employee` ON `employee`.`id_employee` = `sheet`.`id_employee`
LEFT JOIN `project` ON `project`.`id_project` = `sheet`.`id_project`
LEFT JOIN `role` ON `role`.`id_role` = `employee`.`id_role`
ORDER BY `date_sheet` DESC
---
    public function getWithEmployeeAndProjectAndRole()
    {
        return $this->select('sheet.*, employee.nama_employee, project.nama_project, role.judul_role')
            ->join('employee', 'employee.id_employee = sheet.id_employee', 'left')
            ->join('project', 'project.id_project = sheet.id_project', 'left')
            ->join('role', 'role.id_role = employee.id_role', 'left')
            ->orderBy('date_sheet', 'DESC')
            ->findAll();

SELECT `sheet`.*, `employee`.`nama_employee`, `project`.`nama_project`, `role`.`judul_role`, SUM(sheet.hours_sheet) as total_minutes
FROM `sheet`
JOIN `employee` ON `employee`.`id_employee` = `sheet`.`id_employee`
JOIN `project` ON `project`.`id_project` = `sheet`.`id_project`
JOIN `role` ON `role`.`id_role` = `employee`.`id_role`
WHERE `sheet`.`id_employee` = '4'
GROUP BY `sheet`.`id_project`
ORDER BY `sheet`.`last_modified` DESC
---
    public function getRecentSheetsByEmployee($id_employee, $limit = 5)
{
    return $this->select('sheet.*, employee.nama_employee, project.nama_project, role.judul_role')
        ->join('employee', 'employee.id_employee = sheet.id_employee')
        ->join('project', 'project.id_project = sheet.id_project')
        ->join('role', 'role.id_role = employee.id_role')
        ->where('sheet.id_employee', $id_employee)
        ->orderBy('sheet.last_modified', 'DESC')
        ->limit($limit)
        ->findAll();

SELECT `sheet`.*, `employee`.`nama_employee`, `project`.`nama_project`, `role`.`judul_role`
FROM `sheet`
JOIN `employee` ON `employee`.`id_employee` = `sheet`.`id_employee`
JOIN `project` ON `project`.`id_project` = `sheet`.`id_project`
JOIN `role` ON `role`.`id_role` = `employee`.`id_role`
WHERE `sheet`.`id_employee` = '5'
AND `sheet`.`id_sheet` = '10'
 LIMIT 1
---
    public function getDetailById($id_sheet, $id_employee)
    {
        return $this->select('sheet.*, employee.nama_employee, project.nama_project, role.judul_role')
            ->join('employee', 'employee.id_employee = sheet.id_employee')
            ->join('project', 'project.id_project = sheet.id_project')
            ->join('role', 'role.id_role = employee.id_role')
            ->where('sheet.id_employee', $id_employee)
            ->where('sheet.id_sheet', $id_sheet)
            ->first();

SELECT `s`.`id_sheet`, `s`.`id_project`, `p`.`nama_project`, `e`.`nama_employee`, `r`.`judul_role`, SUM(s.hours_sheet) as total_minutes, MAX(s.last_modified) as last_modified
FROM `sheet` `s`
JOIN `employee` `e` ON `s`.`id_employee` = `e`.`id_employee`
JOIN `project` `p` ON `s`.`id_project` = `p`.`id_project`
JOIN `role` `r` ON `r`.`id_role` = `e`.`id_role`
WHERE `s`.`id_project` = '3'
GROUP BY `s`.`id_employee`
---
    public function getDetailWithAllRelations($id_sheet)
    {
        return $this->select('sheet.*, employee.nama_employee, project.nama_project, role.judul_role')
            ->join('employee', 'employee.id_employee = sheet.id_employee', 'left')
            ->join('project', 'project.id_project = sheet.id_project', 'left')
            ->join('role', 'role.id_role = employee.id_role', 'left')
            ->where('sheet.id_sheet', $id_sheet)
            ->first();

SELECT `sheet`.*, `employee`.`nama_employee`, `project`.`nama_project`, `role`.`judul_role`
FROM `sheet`
JOIN `employee` ON `employee`.`id_employee` = `sheet`.`id_employee`
JOIN `project` ON `project`.`id_project` = `sheet`.`id_project`
JOIN `role` ON `role`.`id_role` = `employee`.`id_role`
WHERE `sheet`.`id_project` = '3'
ORDER BY `sheet`.`date_sheet` DESC
---
    public function getAllSheetsByProject($id_project)
{
    return $this->select('sheet.*, employee.nama_employee, project.nama_project, role.judul_role')
                ->join('employee', 'employee.id_employee = sheet.id_employee')
                ->join('project', 'project.id_project = sheet.id_project')
                ->join('role', 'role.id_role = employee.id_role')
                ->where('sheet.id_project', $id_project)
                ->orderBy('sheet.date_sheet', 'DESC')
                ->findAll();